app/controllers/admin/genres_controller.rb

SELECT "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"
---
  def index
    @genre = Genre.new
    @genres = Genre.page(params[:page])

SELECT "genres".* FROM "genres"
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "リング製本"], ["created_at", "2022-05-14 09:14:21.574414"], ["updated_at", "2022-05-14 09:14:21.574414"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genres = Genre.page(params[:page])
    if @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "三つ折り"], ["updated_at", "2022-05-15 04:58:45.334898"], ["id", 6]]
---
  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)