app/controllers/admin/products_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @product = Product.new
    @genres = Genre.all

INSERT INTO "products" ("genre_id", "delivery_date", "product_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["genre_id", 1], ["delivery_date", "2022-06-10"], ["product_count", 1000], ["created_at", "2022-05-10 12:57:27.697836"], ["updated_at", "2022-05-10 12:57:27.697836"]]
---
  def create
    @product = Product.new(products_params)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def edit
    @product = Product.find(params[:id])
    @genres = Genre.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "delivery_date" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["delivery_date", "2022-06-11"], ["updated_at", "2022-05-11 05:23:17.385295"], ["id", 3]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(products_params)