app/controllers/admin/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @workers = Worker.all

SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @worker = Worker.find(params[:id])

SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @worker = Worker.find(params[:id])

SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "workers" SET "updated_at" = ?, "is_deleted" = ? WHERE "workers"."id" = ?  [["updated_at", "2022-05-15 05:53:29.197185"], ["is_deleted", 1], ["id", 1]]
---
  def update
    @worker = Worker.find(params[:id])
    @worker.update(workers_params)