app/controllers/worker/products_controller.rb

  def show
    @product = Product.find(params[:id])
    @new_progress = Progress.new
    @progress = Progress.find_by(product_id: @product.id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "progresses".* FROM "progresses" WHERE "progresses"."product_id" = ? LIMIT ?  [["product_id", 1], ["LIMIT", 1]]