app/controllers/worker/progresses_controller.rb

  def start
    @progress = Progress.new
    @progress.product.id = params[:product_id]
    @progress.worker_id = current_worker.id
    @progress.begin_time = Datetime.now
    @progress.save
---
INSERT INTO "progresses" ("worker_id", "product_id", "begin_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["worker_id", 2], ["product_id", 1], ["begin_time", "2022-05-17 11:44:18.273414"], ["created_at", "2022-05-17 11:44:18.286174"], ["updated_at", "2022-05-17 11:44:18.286174"]]

  def finish
    @progress = Progress.find(params[:progress_id])
    @progress.end_time = Datetime.now
    @progress.save
---
SELECT "progresses".* FROM "progresses" WHERE "progresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "progresses" SET "end_time" = ?, "updated_at" = ? WHERE "progresses"."id" = ?  [["end_time", "2022-05-17 12:54:04.034004"], ["updated_at", "2022-05-17 12:54:04.056341"], ["id", 1]]