app/controllers/worker/workers_controller.rb

  def index
    @workers = Worker.all
---
SELECT "workers".* FROM "workers"

  def show
    @worker = Worker.find(params[:id])
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @worker = Worker.find(params[:id])
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @worker = Worker.find(params[:id])
    @worker.update(workers_params)
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "workers" SET "updated_at" = ?, "email" = ? WHERE "workers"."id" = ?  [["updated_at", "2022-05-13 09:30:11.267967"], ["email", "c@c"], ["id", 2]]